#параметры системы
width = 400
height = 250
white = (255,255,255)
red = (240,10,10)
black = (0,0,0)
green = (10,240,10)
fps = 3

#высокий срок жизни
old1_range = 20 #варианты смерти
old1_dead = 18 #+1 или больше == смерть
#низкий срок жизни
old1_range = 30 #варианты смерти
old1_dead = 23 #+1 или больше == смерть

#голод
max_hunger = 20 #равно или больше == смерть
hunger_last_bersday = 10#после создания потомка голод родителя равен...

dead_start = 70#после будут включены смерти

gen_mutation_range = 20#варианты мутации
gen_change = 17#+1 или больше == мутация случайного гена